app/homework3/ab_tests/ab_nginx_static
maks@maks ~/quack> ab -c 4 -n 5000 www.quack.com/public
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking www.quack.com (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        nginx/1.10.3
Server Hostname:        www.quack.com
Server Port:            80

Document Path:          /public
Document Length:        194 bytes

Concurrency Level:      4
Time taken for tests:   0.605 seconds
Complete requests:      5000
Failed requests:        0
Non-2xx responses:      5000
Total transferred:      2005000 bytes
HTML transferred:       970000 bytes
Requests per second:    8263.73 [#/sec] (mean)
Time per request:       0.484 [ms] (mean)
Time per request:       0.121 [ms] (mean, across all concurrent requests)
Transfer rate:          3236.09 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       9
Processing:     0    0   0.6      0       9
Waiting:        0    0   0.6      0       8
Total:          0    0   0.7      0       9

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      1
  90%      1
  95%      1
  98%      2
  99%      5
 100%      9 (longest request)